RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_emb.c
/**
 *******************************************************************************
 * @file  hc32f4a0_emb.c
 * @brief This file provides firmware functions to manage the EMB
 *        (Emergency Brake).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hongjh          First version
   2020-07-07       Hongjh          Replace the word Timer with TMR abbreviation
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_emb.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_EMB EMB
 * @brief Emergency Brake Driver Library
 * @{
 */

#if (DDL_EMB_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EMB_Local_Macros EMB Local Macros
 * @{
 */

/**
 * @defgroup EMB_Check_Parameters_Validity EMB Check Parameters Validity
 * @{
 */

#define IS_VALID_EMB(x)                                                        \
(   ((x) == M4_EMB0)                            ||                             \
    ((x) == M4_EMB1)                            ||                             \
    ((x) == M4_EMB2)                            ||                             \
    ((x) == M4_EMB3)                            ||                             \
    ((x) == M4_EMB4)                            ||                             \
    ((x) == M4_EMB5)                            ||                             \
    ((x) == M4_EMB6))

#define IS_VALID_EMB_TMR6(x)                                                   \
(   ((x) == M4_EMB0)                            ||                             \
    ((x) == M4_EMB1)                            ||                             \
    ((x) == M4_EMB2)                            ||                             \
    ((x) == M4_EMB3))

#define IS_VALID_EMB_TIMER4(x)                                                 \
(   ((x) == M4_EMB4)                            ||                             \
    ((x) == M4_EMB5)                            ||                             \
    ((x) == M4_EMB6))

#define IS_VALID_EMB_CMP1_SEL(x)                                               \
(   ((x) == EMB_CMP1_ENABLE)                    ||                             \
    ((x) == EMB_CMP1_DISABLE))

#define IS_VALID_EMB_CMP2_SEL(x)                                               \
(   ((x) == EMB_CMP2_ENABLE)                    ||                             \
    ((x) == EMB_CMP2_DISABLE))

#define IS_VALID_EMB_CMP3_SEL(x)                                               \
(   ((x) == EMB_CMP3_ENABLE)                    ||                             \
    ((x) == EMB_CMP3_DISABLE))

#define IS_VALID_EMB_CMP4_SEL(x)                                               \
(   ((x) == EMB_CMP4_ENABLE)                    ||                             \
    ((x) == EMB_CMP4_DISABLE))

#define IS_VALID_EMB_PORT1_SEL(x)                                              \
(   ((x) == EMB_PORT1_ENABLE)                   ||                             \
    ((x) == EMB_PORT1_DISABLE))

#define IS_VALID_EMB_PORT2_SEL(x)                                              \
(   ((x) == EMB_PORT2_ENABLE)                   ||                             \
    ((x) == EMB_PORT2_DISABLE))

#define IS_VALID_EMB_PORT3_SEL(x)                                              \
(   ((x) == EMB_PORT3_ENABLE)                   ||                             \
    ((x) == EMB_PORT3_DISABLE))

#define IS_VALID_EMB_PORT4_SEL(x)                                              \
(   ((x) == EMB_PORT4_ENABLE)                   ||                             \
    ((x) == EMB_PORT4_DISABLE))

#define IS_VALID_EMB_OSC_SEL(x)                                                \
(   ((x) == EMB_OSC_ENABLE)                     ||                             \
    ((x) == EMB_OSC_DISABLE))

#define IS_VALID_EMB_TMR4_PWM_W_SEL(x)                                         \
(   ((x) == EMB_TMR4_PWM_W_ENABLE)              ||                             \
    ((x) == EMB_TMR4_PWM_W_DISABLE))

#define IS_VALID_EMB_TMR4_PWM_V_SEL(x)                                         \
(   ((x) == EMB_TMR4_PWM_V_ENABLE)              ||                             \
    ((x) == EMB_TMR4_PWM_V_DISABLE))

#define IS_VALID_EMB_TMR4_PWM_U_SEL(x)                                         \
(   ((x) == EMB_TMR4_PWM_U_ENABLE)              ||                             \
    ((x) == EMB_TMR4_PWM_U_DISABLE))

#define IS_VALID_EMB_TMR6_1_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_1_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_1_PWM_DISABLE))

#define IS_VALID_EMB_TMR6_2_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_2_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_2_PWM_DISABLE))

#define IS_VALID_EMB_TMR6_3_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_3_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_3_PWM_DISABLE))

