RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_emb.c
#define IS_VALID_EMB_TMR6_4_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_4_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_4_PWM_DISABLE))

#define IS_VALID_EMB_TMR6_5_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_5_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_5_PWM_DISABLE))

#define IS_VALID_EMB_TMR6_6_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_6_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_6_PWM_DISABLE))

#define IS_VALID_EMB_TMR6_7_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_7_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_7_PWM_DISABLE))

#define IS_VALID_EMB_TMR6_8_PWM_SEL(x)                                         \
(   ((x) == EMB_TMR6_8_PWM_ENABLE)              ||                             \
    ((x) == EMB_TMR6_8_PWM_DISABLE))

#define IS_VALID_EMB_DETECT_PORT1_LEVEL(x)                                     \
(   ((x) == EMB_DETECT_PORT1_LEVEL_LOW)         ||                             \
    ((x) == EMB_DETECT_PORT1_LEVEL_HIGH))

#define IS_VALID_EMB_DETECT_PORT2_LEVEL(x)                                     \
(   ((x) == EMB_DETECT_PORT2_LEVEL_LOW)         ||                             \
    ((x) == EMB_DETECT_PORT2_LEVEL_HIGH))

#define IS_VALID_EMB_DETECT_PORT3_LEVEL(x)                                     \
(   ((x) == EMB_DETECT_PORT3_LEVEL_LOW)         ||                             \
    ((x) == EMB_DETECT_PORT3_LEVEL_HIGH))

#define IS_VALID_EMB_DETECT_PORT4_LEVEL(x)                                     \
(   ((x) == EMB_DETECT_PORT4_LEVEL_LOW)         ||                             \
    ((x) == EMB_DETECT_PORT4_LEVEL_HIGH))

#define IS_VALID_EMB_DETECT_TMR4_PWM_W_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR4_PWM_W_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR4_PWM_W_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR4_PWM_V_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR4_PWM_V_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR4_PWM_V_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR4_PWM_U_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR4_PWM_U_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR4_PWM_U_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_1_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_1_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_1_PWM_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_2_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_2_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_2_PWM_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_3_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_3_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_3_PWM_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_4_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_4_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_4_PWM_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_5_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_5_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_5_PWM_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_6_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_6_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_6_PWM_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_7_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_7_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_7_PWM_BOTH_HIGH))

#define IS_VALID_EMB_DETECT_TMR6_8_PWM_LEVEL(x)                                \
(   ((x) == EMB_DETECT_TMR6_8_PWM_BOTH_LOW)     ||                             \
    ((x) == EMB_DETECT_TMR6_8_PWM_BOTH_HIGH))

#define IS_VALID_EMB_INT(x)                                                    \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~IS_EMB_INT_MASK))))

#define IS_VALID_EMB_FLAG(x)                                                   \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~IS_EMB_FLAG_MASK))))

#define IS_VALID_EMB_STATUS(x)                                                 \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~IS_EMB_STATUS_MASK))))

#define IS_VALID_EMB_PORT1_FILTER_DIV(x)                                       \
(   ((x) == EMB_PORT1_FILTER_NONE)              ||                             \
    ((x) == EMB_PORT1_FILTER_CLK_DIV1)          ||                             \
    ((x) == EMB_PORT1_FILTER_CLK_DIV8)          ||                             \
    ((x) == EMB_PORT1_FILTER_CLK_DIV32)         ||                             \
    ((x) == EMB_PORT1_FILTER_CLK_DIV128))

#define IS_VALID_EMB_PORT2_FILTER_DIV(x)                                       \
(   ((x) == EMB_PORT2_FILTER_NONE)              ||                             \
    ((x) == EMB_PORT2_FILTER_CLK_DIV1)          ||                             \
    ((x) == EMB_PORT2_FILTER_CLK_DIV8)          ||                             \
    ((x) == EMB_PORT2_FILTER_CLK_DIV32)         ||                             \
    ((x) == EMB_PORT2_FILTER_CLK_DIV128))

#define IS_VALID_EMB_PORT3_FILTER_DIV(x)                                       \
(   ((x) == EMB_PORT3_FILTER_NONE)              ||                             \
    ((x) == EMB_PORT3_FILTER_CLK_DIV1)          ||                             \
    ((x) == EMB_PORT3_FILTER_CLK_DIV8)          ||                             \
    ((x) == EMB_PORT3_FILTER_CLK_DIV32)         ||                             \
    ((x) == EMB_PORT3_FILTER_CLK_DIV128))

