RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_emb.c
#define IS_VALID_EMB_PORT4_FILTER_DIV(x)                                       \
(   ((x) == EMB_PORT4_FILTER_NONE)              ||                             \
    ((x) == EMB_PORT4_FILTER_CLK_DIV1)          ||                             \
    ((x) == EMB_PORT4_FILTER_CLK_DIV8)          ||                             \
    ((x) == EMB_PORT4_FILTER_CLK_DIV32)         ||                             \
    ((x) == EMB_PORT4_FILTER_CLK_DIV128))

#define IS_VALID_EMB_RELEASE_PWM_SEL(x)                                        \
(   ((x) == EMB_RELEASE_PWM_SEL_FLAG_ZERO)      ||                             \
    ((x) == EMB_RELEASE_PWM_SEL_STATE_ZERO))

#define IS_VALID_EMB_MONITOR_EVENT(x)                                          \
(   ((x) == EMB_EVENT_PWMS)                     ||                             \
    ((x) == EMB_EVENT_CMP)                      ||                             \
    ((x) == EMB_EVENT_OSC)                      ||                             \
    ((x) == EMB_EVENT_PORT1)                    ||                             \
    ((x) == EMB_EVENT_PORT2)                    ||                             \
    ((x) == EMB_EVENT_PORT3)                    ||                             \
    ((x) == EMB_EVENT_PORT4))
/**
 * @}
 */

/**
 * @defgroup EMB_INT_Mask EMB interrupt mask definition
 * @{
 */
#define IS_EMB_INT_MASK                         (EMB_INT_PWMS  |               \
                                                 EMB_INT_CMP   |               \
                                                 EMB_INT_OSC   |               \
                                                 EMB_INT_PORT1 |               \
                                                 EMB_INT_PORT2 |               \
                                                 EMB_INT_PORT3 |               \
                                                 EMB_INT_PORT4)
/**
 * @}
 */

/**
 * @defgroup EMB_Flag_Mask EMB flag mask definition
 * @{
 */
#define IS_EMB_FLAG_MASK                        (EMB_FLAG_PWMS  |              \
                                                 EMB_FLAG_CMP   |              \
                                                 EMB_FLAG_OSC   |              \
                                                 EMB_FLAG_PORT1 |              \
                                                 EMB_FLAG_PORT2 |              \
                                                 EMB_FLAG_PORT3 |              \
                                                 EMB_FLAG_PORT4)
/**
 * @}
 */

/**
 * @defgroup EMB_Status_Mask EMB status mask definition
 * @{
 */
#define IS_EMB_STATUS_MASK                      (EMB_STATE_PWMS  |             \
                                                 EMB_STATE_CMP   |             \
                                                 EMB_STATE_OSC   |             \
                                                 EMB_STATE_PORT1 |             \
                                                 EMB_STATE_PORT2 |             \
                                                 EMB_STATE_PORT3 |             \
                                                 EMB_STATE_PORT4)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup EMB_Global_Functions EMB Global Functions
 * @{
 */

/**
 * @brief  Initialize EMB for TMR4.
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_emb_tmr4_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 * @note   TMR4 feature is supported by M4_EMB4/M4_EMB5/M4_EMB6
 */
en_result_t EMB_Tmr4Init(M4_EMB_TypeDef *EMBx,
                            const stc_emb_tmr4_init_t *pstcInit)
{
    uint32_t u32RegVal;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_EMB_TIMER4(EMBx));
        DDL_ASSERT(IS_VALID_EMB_CMP1_SEL(pstcInit->u32Cmp1));
        DDL_ASSERT(IS_VALID_EMB_CMP2_SEL(pstcInit->u32Cmp2));
        DDL_ASSERT(IS_VALID_EMB_CMP3_SEL(pstcInit->u32Cmp3));
        DDL_ASSERT(IS_VALID_EMB_CMP4_SEL(pstcInit->u32Cmp4));
        DDL_ASSERT(IS_VALID_EMB_OSC_SEL(pstcInit->u32Osc));
        DDL_ASSERT(IS_VALID_EMB_PORT1_SEL(pstcInit->stcPort1.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT1_LEVEL(pstcInit->stcPort1.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT1_FILTER_DIV(pstcInit->stcPort1.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT2_SEL(pstcInit->stcPort2.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT2_LEVEL(pstcInit->stcPort2.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT2_FILTER_DIV(pstcInit->stcPort2.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT3_SEL(pstcInit->stcPort3.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT3_LEVEL(pstcInit->stcPort3.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT3_FILTER_DIV(pstcInit->stcPort3.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT4_SEL(pstcInit->stcPort4.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT4_LEVEL(pstcInit->stcPort4.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT4_FILTER_DIV(pstcInit->stcPort4.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_TMR4_PWM_U_SEL(pstcInit->stcTmr4PwmU.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR4_PWM_U_LEVEL(pstcInit->stcTmr4PwmU.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR4_PWM_V_SEL(pstcInit->stcTmr4PwmV.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR4_PWM_V_LEVEL(pstcInit->stcTmr4PwmV.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR4_PWM_W_SEL(pstcInit->stcTmr4PwmW.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR4_PWM_W_LEVEL(pstcInit->stcTmr4PwmW.u32PwmLevel));

        /* Set default value && clear flag */
        WRITE_REG32(EMBx->SOE, 0x00UL);
        WRITE_REG32(EMBx->RLSSEL, 0x00UL);
        WRITE_REG32(EMBx->INTEN, 0x00UL);
        WRITE_REG32(EMBx->STATCLR, (EMB_STATCLR_PWMSFCLR | \
                                    EMB_STATCLR_CMPFCLR | \
                                    EMB_STATCLR_OSFCLR | \
                                    EMB_STATCLR_PORTINFCLR1 | \
                                    EMB_STATCLR_PORTINFCLR2 | \
                                    EMB_STATCLR_PORTINFCLR3 | \
                                    EMB_STATCLR_PORTINFCLR4));

        /* Set EMB_CTL register */
        u32RegVal = (pstcInit->u32Cmp1 | \
                     pstcInit->u32Cmp2 | \
                     pstcInit->u32Cmp3 | \
                     pstcInit->u32Cmp4 | \
                     pstcInit->u32Osc | \
                     pstcInit->stcTmr4PwmW.u32PwmSel | \
                     pstcInit->stcTmr4PwmV.u32PwmSel | \
                     pstcInit->stcTmr4PwmU.u32PwmSel | \
                     pstcInit->stcPort1.u32PortSel | \
                     pstcInit->stcPort2.u32PortSel | \
                     pstcInit->stcPort3.u32PortSel | \
                     pstcInit->stcPort4.u32PortSel | \
                     pstcInit->stcPort1.u32PortLevel | \
                     pstcInit->stcPort2.u32PortLevel | \
                     pstcInit->stcPort3.u32PortLevel | \
                     pstcInit->stcPort4.u32PortLevel);
        WRITE_REG32(EMBx->CTL1, u32RegVal);

