RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_emb.c
        /* Check writing EMB_CTL1 because EMB_CTL1 can write once only after reset */
        if (READ_REG32(EMBx->CTL1) == u32RegVal)
        {
            u32RegVal = (pstcInit->stcTmr4PwmW.u32PwmLevel | \
                         pstcInit->stcTmr4PwmV.u32PwmLevel | \
                         pstcInit->stcTmr4PwmU.u32PwmLevel | \
                         pstcInit->stcPort1.u32PortFilterDiv | \
                         pstcInit->stcPort2.u32PortFilterDiv | \
                         pstcInit->stcPort3.u32PortFilterDiv | \
                         pstcInit->stcPort4.u32PortFilterDiv);
            WRITE_REG32(EMBx->CTL2, u32RegVal);

            /* Check writing EMB_CTL2 because EMB_CTL2 can write once only after reset */
            if (READ_REG32(EMBx->CTL2) == u32RegVal)
            {
                 enRet = Ok;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_emb_tmr4_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_emb_tmr4_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EMB_Tmr4StructInit(stc_emb_tmr4_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Cmp1 = EMB_CMP1_DISABLE;
        pstcInit->u32Cmp2 = EMB_CMP2_DISABLE;
        pstcInit->u32Cmp3 = EMB_CMP3_DISABLE;
        pstcInit->u32Cmp4 = EMB_CMP4_DISABLE;
        pstcInit->u32Osc = EMB_OSC_DISABLE;
        pstcInit->stcPort1.u32PortSel = EMB_PORT1_DISABLE;
        pstcInit->stcPort1.u32PortLevel = EMB_DETECT_PORT1_LEVEL_HIGH;
        pstcInit->stcPort1.u32PortFilterDiv = EMB_PORT1_FILTER_NONE;
        pstcInit->stcPort2.u32PortSel = EMB_PORT2_DISABLE;
        pstcInit->stcPort2.u32PortLevel = EMB_DETECT_PORT2_LEVEL_HIGH;
        pstcInit->stcPort2.u32PortFilterDiv = EMB_PORT2_FILTER_NONE;
        pstcInit->stcPort3.u32PortSel = EMB_PORT3_DISABLE;
        pstcInit->stcPort3.u32PortLevel = EMB_DETECT_PORT3_LEVEL_HIGH;
        pstcInit->stcPort3.u32PortFilterDiv = EMB_PORT3_FILTER_NONE;
        pstcInit->stcPort4.u32PortSel = EMB_PORT4_DISABLE;
        pstcInit->stcPort4.u32PortLevel = EMB_DETECT_PORT4_LEVEL_HIGH;
        pstcInit->stcPort4.u32PortFilterDiv = EMB_PORT4_FILTER_NONE;
        pstcInit->stcTmr4PwmU.u32PwmSel = EMB_TMR4_PWM_U_DISABLE;
        pstcInit->stcTmr4PwmU.u32PwmLevel = EMB_DETECT_TMR4_PWM_U_BOTH_LOW;
        pstcInit->stcTmr4PwmV.u32PwmSel = EMB_TMR4_PWM_V_DISABLE;
        pstcInit->stcTmr4PwmV.u32PwmLevel = EMB_DETECT_TMR4_PWM_V_BOTH_LOW;
        pstcInit->stcTmr4PwmW.u32PwmSel = EMB_TMR4_PWM_W_DISABLE;
        pstcInit->stcTmr4PwmW.u32PwmLevel = EMB_DETECT_TMR4_PWM_W_BOTH_LOW;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize EMB for TMR6.
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_emb_tmr6_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 * @note   TMR6 feature is supported by M4_EMB0/M4_EMB1/M4_EMB2/M4_EMB3
 */
en_result_t EMB_Tmr6Init(M4_EMB_TypeDef *EMBx,
                            const stc_emb_tmr6_init_t *pstcInit)
{
    uint32_t u32RegVal;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_EMB_TMR6(EMBx));
        DDL_ASSERT(IS_VALID_EMB_CMP1_SEL(pstcInit->u32Cmp1));
        DDL_ASSERT(IS_VALID_EMB_CMP2_SEL(pstcInit->u32Cmp2));
        DDL_ASSERT(IS_VALID_EMB_CMP3_SEL(pstcInit->u32Cmp3));
        DDL_ASSERT(IS_VALID_EMB_CMP4_SEL(pstcInit->u32Cmp4));
        DDL_ASSERT(IS_VALID_EMB_OSC_SEL(pstcInit->u32Osc));
        DDL_ASSERT(IS_VALID_EMB_PORT1_SEL(pstcInit->stcPort1.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT1_LEVEL(pstcInit->stcPort1.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT1_FILTER_DIV(pstcInit->stcPort1.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT2_SEL(pstcInit->stcPort2.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT2_LEVEL(pstcInit->stcPort2.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT2_FILTER_DIV(pstcInit->stcPort2.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT3_SEL(pstcInit->stcPort3.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT3_LEVEL(pstcInit->stcPort3.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT3_FILTER_DIV(pstcInit->stcPort3.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT4_SEL(pstcInit->stcPort4.u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_PORT4_LEVEL(pstcInit->stcPort4.u32PortLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT4_FILTER_DIV(pstcInit->stcPort4.u32PortFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_TMR6_1_PWM_SEL(pstcInit->stcTmr6_1.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_1_PWM_LEVEL(pstcInit->stcTmr6_1.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR6_2_PWM_SEL(pstcInit->stcTmr6_2.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_2_PWM_LEVEL(pstcInit->stcTmr6_2.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR6_3_PWM_SEL(pstcInit->stcTmr6_3.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_3_PWM_LEVEL(pstcInit->stcTmr6_3.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR6_4_PWM_SEL(pstcInit->stcTmr6_4.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_4_PWM_LEVEL(pstcInit->stcTmr6_4.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR6_5_PWM_SEL(pstcInit->stcTmr6_5.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_5_PWM_LEVEL(pstcInit->stcTmr6_5.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR6_6_PWM_SEL(pstcInit->stcTmr6_6.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_6_PWM_LEVEL(pstcInit->stcTmr6_6.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR6_7_PWM_SEL(pstcInit->stcTmr6_7.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_7_PWM_LEVEL(pstcInit->stcTmr6_7.u32PwmLevel));
        DDL_ASSERT(IS_VALID_EMB_TMR6_8_PWM_SEL(pstcInit->stcTmr6_8.u32PwmSel));
        DDL_ASSERT(IS_VALID_EMB_DETECT_TMR6_8_PWM_LEVEL(pstcInit->stcTmr6_8.u32PwmLevel));

        /* Set default value && clear flag */
        WRITE_REG32(EMBx->SOE, 0x00UL);
        WRITE_REG32(EMBx->RLSSEL, 0x00UL);
        WRITE_REG32(EMBx->INTEN, 0x00UL);
        WRITE_REG32(EMBx->STATCLR, (EMB_STATCLR_PWMSFCLR | \
                                    EMB_STATCLR_CMPFCLR | \
                                    EMB_STATCLR_OSFCLR | \
                                    EMB_STATCLR_PORTINFCLR1 | \
                                    EMB_STATCLR_PORTINFCLR2 | \
                                    EMB_STATCLR_PORTINFCLR3 | \
                                    EMB_STATCLR_PORTINFCLR4));

        /* Set EMB_CTL register */
        u32RegVal = (pstcInit->u32Cmp1 | \
                     pstcInit->u32Cmp2 | \
                     pstcInit->u32Cmp3 | \
                     pstcInit->u32Cmp4 | \
                     pstcInit->u32Osc | \
                     pstcInit->stcTmr6_1.u32PwmSel | \
                     pstcInit->stcTmr6_2.u32PwmSel | \
                     pstcInit->stcTmr6_3.u32PwmSel | \
                     pstcInit->stcTmr6_4.u32PwmSel | \
                     pstcInit->stcTmr6_5.u32PwmSel | \
                     pstcInit->stcTmr6_6.u32PwmSel | \
                     pstcInit->stcTmr6_7.u32PwmSel | \
                     pstcInit->stcTmr6_8.u32PwmSel | \
                     pstcInit->stcPort1.u32PortSel | \
                     pstcInit->stcPort2.u32PortSel | \
                     pstcInit->stcPort3.u32PortSel | \
                     pstcInit->stcPort4.u32PortSel | \
                     pstcInit->stcPort1.u32PortLevel | \
                     pstcInit->stcPort2.u32PortLevel | \
                     pstcInit->stcPort3.u32PortLevel | \
                     pstcInit->stcPort4.u32PortLevel);
        WRITE_REG32(EMBx->CTL1, u32RegVal);

