RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_emb.c
        /* Check writing EMB_CTL1 because EMB_CTL1 can write once only after reset */
        if (READ_REG32(EMBx->CTL1) == u32RegVal)
        {
            u32RegVal = (pstcInit->stcTmr6_1.u32PwmLevel | \
                         pstcInit->stcTmr6_2.u32PwmLevel | \
                         pstcInit->stcTmr6_3.u32PwmLevel | \
                         pstcInit->stcTmr6_4.u32PwmLevel | \
                         pstcInit->stcTmr6_5.u32PwmLevel | \
                         pstcInit->stcTmr6_6.u32PwmLevel | \
                         pstcInit->stcTmr6_7.u32PwmLevel | \
                         pstcInit->stcTmr6_8.u32PwmLevel | \
                         pstcInit->stcPort1.u32PortFilterDiv | \
                         pstcInit->stcPort2.u32PortFilterDiv | \
                         pstcInit->stcPort3.u32PortFilterDiv | \
                         pstcInit->stcPort4.u32PortFilterDiv);
            WRITE_REG32(EMBx->CTL2, u32RegVal);

            /* Check writing EMB_CTL2 because EMB_CTL2 can write once only after reset */
            if (READ_REG32(EMBx->CTL2) == u32RegVal)
            {
                 enRet = Ok;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_emb_tmr6_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_emb_tmr6_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EMB_Tmr6StructInit(stc_emb_tmr6_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Cmp1 = EMB_CMP1_DISABLE;
        pstcInit->u32Cmp2 = EMB_CMP2_DISABLE;
        pstcInit->u32Cmp3 = EMB_CMP3_DISABLE;
        pstcInit->u32Cmp4 = EMB_CMP4_DISABLE;
        pstcInit->u32Osc = EMB_OSC_DISABLE;
        pstcInit->stcPort1.u32PortSel = EMB_PORT1_DISABLE;
        pstcInit->stcPort1.u32PortLevel = EMB_DETECT_PORT1_LEVEL_HIGH;
        pstcInit->stcPort1.u32PortFilterDiv = EMB_PORT1_FILTER_NONE;
        pstcInit->stcPort2.u32PortSel = EMB_PORT2_DISABLE;
        pstcInit->stcPort2.u32PortLevel = EMB_DETECT_PORT2_LEVEL_HIGH;
        pstcInit->stcPort2.u32PortFilterDiv = EMB_PORT2_FILTER_NONE;
        pstcInit->stcPort3.u32PortSel = EMB_PORT3_DISABLE;
        pstcInit->stcPort3.u32PortLevel = EMB_DETECT_PORT3_LEVEL_HIGH;
        pstcInit->stcPort3.u32PortFilterDiv = EMB_PORT3_FILTER_NONE;
        pstcInit->stcPort4.u32PortSel = EMB_PORT4_DISABLE;
        pstcInit->stcPort4.u32PortLevel = EMB_DETECT_PORT4_LEVEL_HIGH;
        pstcInit->stcPort4.u32PortFilterDiv = EMB_PORT4_FILTER_NONE;
        pstcInit->stcTmr6_1.u32PwmSel = EMB_TMR6_1_PWM_DISABLE;
        pstcInit->stcTmr6_1.u32PwmLevel = EMB_DETECT_TMR6_1_PWM_BOTH_LOW;
        pstcInit->stcTmr6_2.u32PwmSel = EMB_TMR6_2_PWM_DISABLE;
        pstcInit->stcTmr6_2.u32PwmLevel = EMB_DETECT_TMR6_2_PWM_BOTH_LOW;
        pstcInit->stcTmr6_3.u32PwmSel = EMB_TMR6_3_PWM_DISABLE;
        pstcInit->stcTmr6_3.u32PwmLevel = EMB_DETECT_TMR6_3_PWM_BOTH_LOW;
        pstcInit->stcTmr6_4.u32PwmSel = EMB_TMR6_4_PWM_DISABLE;
        pstcInit->stcTmr6_4.u32PwmLevel = EMB_DETECT_TMR6_4_PWM_BOTH_LOW;
        pstcInit->stcTmr6_5.u32PwmSel = EMB_TMR6_5_PWM_DISABLE;
        pstcInit->stcTmr6_5.u32PwmLevel = EMB_DETECT_TMR6_5_PWM_BOTH_LOW;
        pstcInit->stcTmr6_6.u32PwmSel = EMB_TMR6_6_PWM_DISABLE;
        pstcInit->stcTmr6_6.u32PwmLevel = EMB_DETECT_TMR6_6_PWM_BOTH_LOW;
        pstcInit->stcTmr6_7.u32PwmSel = EMB_TMR6_7_PWM_DISABLE;
        pstcInit->stcTmr6_7.u32PwmLevel = EMB_DETECT_TMR6_7_PWM_BOTH_LOW;
        pstcInit->stcTmr6_8.u32PwmSel = EMB_TMR6_8_PWM_DISABLE;
        pstcInit->stcTmr6_8.u32PwmLevel = EMB_DETECT_TMR6_8_PWM_BOTH_LOW;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize EMB function
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @retval None
 */
void EMB_DeInit(M4_EMB_TypeDef *EMBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB(EMBx));

    /* Configures the registers to reset value. */
    WRITE_REG32(EMBx->SOE, 0x00UL);
    WRITE_REG32(EMBx->RLSSEL, 0x00UL);
    WRITE_REG32(EMBx->INTEN, 0x00UL);
    WRITE_REG32(EMBx->STATCLR, (EMB_STATCLR_PWMSFCLR | \
                                EMB_STATCLR_CMPFCLR | \
                                EMB_STATCLR_OSFCLR | \
                                EMB_STATCLR_PORTINFCLR1 | \
                                EMB_STATCLR_PORTINFCLR2 | \
                                EMB_STATCLR_PORTINFCLR3 | \
                                EMB_STATCLR_PORTINFCLR4));
}

/**
 * @brief  Set the EMB interrupt function
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @param  [in] u32IntSource            EMB interrupt source
 *         This parameter can be one of the following values:
 *           @arg EMB_INT_PWMS:         PWM same phase event interrupt
 *           @arg EMB_INT_CMP:          CMP result event interrupt
 *           @arg EMB_INT_OSC:          OSC stop event interrupt
 *           @arg EMB_INT_PORT1:        Port1 input event interrupt
 *           @arg EMB_INT_PORT2:        Port2 input event interrupt
 *           @arg EMB_INT_PORT3:        Port3 input event interrupt
 *           @arg EMB_INT_PORT4:        Port4 input event interrupt
 * @param  [in] enNewState              The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void EMB_IntCmd(M4_EMB_TypeDef *EMBx,
                    uint32_t u32IntSource,
                    en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB(EMBx));
    DDL_ASSERT(IS_VALID_EMB_INT(u32IntSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

