RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_emb.c
    if (Enable == enNewState)
    {
        SET_REG32_BIT(EMBx->INTEN, u32IntSource);
    }
    else
    {
        CLEAR_REG32_BIT(EMBx->INTEN, u32IntSource);
    }
}

/**
 * @brief  Set EMB release PWM mode
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @param  [in] u32Event                Monitor event
 *         This parameter can be any composed value of the following values:
 *           @arg EMB_EVENT_PWMS:       PWM same phase event
 *           @arg EMB_EVENT_CMP:        CMP result event
 *           @arg EMB_EVENT_OSC:        OSC stop event
 *           @arg EMB_EVENT_PORT1:      Port1 input event
 *           @arg EMB_EVENT_PORT2:      Port2 input event
 *           @arg EMB_EVENT_PORT3:      Port3 input event
 *           @arg EMB_EVENT_PORT4:      Port4 input event
 * @param  [in] u32Mode                 Release mode
 *         This parameter can be one of the following values:
 *           @arg EMB_RELEASE_PWM_SEL_FLAG_ZERO: Release PWM when flag bit is zero
 *           @arg EMB_RELEASE_PWM_SEL_STATE_ZERO: Release PWM when state bit is zero
 * @retval None
 */
void EMB_SetReleasePwmMode(M4_EMB_TypeDef *EMBx,
                                uint32_t u32Event,
                                uint32_t u32Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB(EMBx));
    DDL_ASSERT(IS_VALID_EMB_MONITOR_EVENT(u32Event));
    DDL_ASSERT(IS_VALID_EMB_RELEASE_PWM_SEL(u32Mode));

    if (EMB_RELEASE_PWM_SEL_FLAG_ZERO == u32Mode)
    {
        CLEAR_REG32_BIT(EMBx->RLSSEL, u32Event);
    }
    else
    {
        SET_REG32_BIT(EMBx->RLSSEL, u32Event);
    }
}

/**
 * @brief  Get EMB status
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @param  [in] u32Flag                 EMB flag
 *         This parameter can be one of the following values:
 *           @arg EMB_FLAG_PWMS: PWM same phase trigger stop PWM
 *           @arg EMB_FLAG_CMP: CMP trigger stop PWM
 *           @arg EMB_FLAG_OSC: OSC trigger stop PWM
 *           @arg EMB_FLAG_PORT1: EMB Port1 input trigger stop PWM
 *           @arg EMB_FLAG_PORT2: EMB Port2 input trigger stop PWM
 *           @arg EMB_FLAG_PORT3: EMB Port3 input trigger stop PWM
 *           @arg EMB_FLAG_PORT4: EMB Port4 input trigger stop PWM
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t EMB_GetFlag(const M4_EMB_TypeDef *EMBx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB(EMBx));
    DDL_ASSERT(IS_VALID_EMB_FLAG(u32Flag));

    return READ_REG32_BIT(EMBx->STAT, u32Flag) ? Set : Reset;
}

/**
 * @brief  Get EMB status
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @param  [in] u32Flag                 EMB flag
 *         This parameter can be one of the following values:
 *           @arg EMB_FLAG_PWMS: PWM same phase trigger stop PWM
 *           @arg EMB_FLAG_CMP: CMP trigger stop PWM
 *           @arg EMB_FLAG_OSC: OSC trigger stop PWM
 *           @arg EMB_FLAG_PORT1: EMB Port1 input trigger stop PWM
 *           @arg EMB_FLAG_PORT2: EMB Port2 input trigger stop PWM
 *           @arg EMB_FLAG_PORT3: EMB Port3 input trigger stop PWM
 *           @arg EMB_FLAG_PORT4: EMB Port4 input trigger stop PWM
 * @retval None
 */
void EMB_ClearFlag(M4_EMB_TypeDef *EMBx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB(EMBx));
    DDL_ASSERT(IS_VALID_EMB_FLAG(u32Flag));

    SET_REG32_BIT(EMBx->STATCLR, u32Flag);
}

/**
 * @brief  Get EMB status
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @param  [in] u32Status               EMB state
 *         This parameter can be one of the following values:
 *           @arg EMB_STATE_PWMS: PWM same phase occur
 *           @arg EMB_STATE_CMP: CMP comapre event occur
 *           @arg EMB_STATE_OSC: OSC stop event occur
 *           @arg EMB_STATE_PORT1: EMB Port1 input control state
 *           @arg EMB_STATE_PORT2: EMB Port2 input control state
 *           @arg EMB_STATE_PORT3: EMB Port3 input control state
 *           @arg EMB_STATE_PORT4: EMB Port4 input control state
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t EMB_GetStatus(const M4_EMB_TypeDef *EMBx,
                                    uint32_t u32Status)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB(EMBx));
    DDL_ASSERT(IS_VALID_EMB_STATUS(u32Status));

    return READ_REG32_BIT(EMBx->STAT, u32Status) ? Set : Reset;
}

/**
 * @brief  Start/stop EMB software brake
 * @param  [in] EMBx                    Pointer to EMB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_EMB0:              EMB group 0 instance register base
 *           @arg M4_EMB1:              EMB group 1 instance register base
 *           @arg M4_EMB2:              EMB group 2 instance register base
 *           @arg M4_EMB3:              EMB group 3 instance register base
 *           @arg M4_EMB4:              EMB group 4 instance register base
 *           @arg M4_EMB5:              EMB group 5 instance register base
 *           @arg M4_EMB6:              EMB group 6 instance register base
 * @param  [in] enNewState              The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void EMB_SwBrake(M4_EMB_TypeDef *EMBx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB(EMBx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(EMBx->SOE, enNewState);
}

/**
 * @}
 */

#endif /* DDL_EMB_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
